# Задача 24: В фермерском хозяйстве в Карелии выращивают чернику. Она растет на
# круглой грядке, причем кусты высажены только по окружности. Таким образом, у
# каждого куста есть ровно два соседних. Всего на грядке растет N кустов.
# Эти кусты обладают разной урожайностью, поэтому ко времени сбора на них
# выросло различное число ягод – на i-ом кусте выросло ai
#  ягод.
# В этом фермерском хозяйстве внедрена система автоматического сбора черники.
# Эта система состоит из управляющего модуля и нескольких собирающих модулей.
# Собирающий модуль за один заход, находясь непосредственно перед некоторым
# кустом, собирает ягоды с этого куста и с двух соседних с ним.
# Напишите программу для нахождения максимального числа ягод, которое может
# собрать за один заход собирающий модуль, находясь перед некоторым кустом
# заданной во входном файле грядки.


from random import randint
garden = int(input(" введите количество кустов: "))
berry = [randint(1,100)for _ in range(garden)]
print(berry)
max_sum, sum_ = berry[-2] + berry[-1] + berry[0],0

for i in range(garden - 1):
    sum_ = berry[i-1] + berry[i] + berry[i+1]
    if sum_ > max_sum:
        max_sum = sum_

print(max_sum)        


